Repository: jshmrtn/vue3-gettext
Catalog: dev/language/*/app.po
Languages: fr_fr, zh_cn

source: %{ n } book
fr_fr: %{ n } livre
zh_cn: %{ n } 本书

source: %{ n } car
fr_fr: %{ n } voiture
zh_cn: %{ n } 辆车

source: %{ nComputed } book
fr_fr: %{ nComputed } livre
zh_cn: %{ nComputed } 本书

source: <strong>%{ count }</strong> apple
fr_fr: <strong>%{ count }</strong> pomme
zh_cn: <strong>%{ count }</strong> 个苹果

source: A <b>random</b> number: <i>%{ random }</i>
fr_fr: Un <b>nombre</b> aléatoire : <i>%{ random }</i>
zh_cn: 一个<b>随机</b>数: <i>%{ random }</i>

source: Forgotten your password? Enter your "email address" below, and we'll email instructions for setting a new one.
fr_fr: Mot de passe perdu ? Saisissez votre "adresse électronique" ci-dessous et nous vous enverrons les instructions pour en créer un nouveau.
zh_cn: 忘记密码了吗？请在下面输入你的「电子邮件地址」，我们将通过电子邮件发送设置新密码的说明。

source: Good bye!
fr_fr: Au revoir !
zh_cn: 再见

source: Headline 1
fr_fr: Titre 1
zh_cn: 一级标题

source: Headline 2
fr_fr: Titre 2
zh_cn: 二级标题

source: Headline 3
fr_fr: Titre 3
zh_cn: 三级标题

source: Headline 4
fr_fr: Titre 4
zh_cn: 四级标题

source: Hello <strong>%{ name }</strong>
fr_fr: Bonjour <strong>%{ name }</strong>
zh_cn: <strong>%{ name }</strong> 你好

source: hover here and see the title
zh_cn: 在此悬浮以查看标题

source: In English, '0' (zero) is always plural.
fr_fr: En anglais, '0' (zero) prend toujours le pluriel.
zh_cn: 在英语中，0(零)总是复数。

source: Paragraph
fr_fr: Paragraphe
zh_cn: 段落

source: Select your language:
fr_fr: Sélectionner votre langage
zh_cn: 请选择语言

source: This is %{ obj.name }
fr_fr: C'est %{ obj.name }
zh_cn: 这是 %{ obj.name }

source: use `__` as a alias of gettext
zh_cn: 使用 `__` 作为 gettext 的别名

source: use `_n` as a alias of ngettext
zh_cn: 使用 `_n` 作为 ngettext 的别名

source: use `_x` as a alias of pgettext
zh_cn: 使用 `_x` 作为 pgettext 的别名

source: use `_xn` as a alias of npgettext
zh_cn: 使用 `_xn` 作为 npgettext 的别名

source: Welcome %{ name }
fr_fr: Bienvenue %{ name }
zh_cn: 欢迎 %{ name }

# list-item
source: one message
zh_cn: %{n} 条消息

# title
source: This is my title
zh_cn: 这是我的标题
